{
  "columbia_university": {
    "university": "Columbia University",
    "ranking": 6,
    "acceptance_rate": "~3.9%",
    "admissions_office_urls": {
      "main_admissions": "https://undergrad.admissions.columbia.edu/",
      "apply": "https://undergrad.admissions.columbia.edu/apply",
      "content_portal": "https://undergrad.admissions.columbia.edu/content",
      "contact": "https://undergrad.admissions.columbia.edu/contact",
      "visiting": "https://undergrad.admissions.columbia.edu/visit"
    },
    "counselor_perspectives": {
      "overall_philosophy": "Columbia seeks students who are ready to engage with the Core Curriculum and New York City. We look for intellectual curiosity, engagement with big ideas, and students who will thrive in our unique urban environment while building community.",
      "mission_alignment": "Columbia's Core Curriculum requires all students to engage with foundational texts in literature, philosophy, science, and the arts. Admissions seeks students excited by this rigorous common intellectual experience and ready to contribute to classroom discussions.",
      "what_they_seek": [
        "Intellectual engagement with big ideas and texts",
        "Readiness for Core Curriculum's intensive reading and discussion",
        "Students who will engage with NYC as an extension of campus",
        "Diverse perspectives to enrich Core discussions",
        "Academic excellence and intellectual curiosity",
        "Students who thrive in structured academic environment",
        "Community builders despite urban setting",
        "Initiative and leadership"
      ],
      "evaluation_philosophy": "Columbia's holistic review emphasizes fit with the Core Curriculum and urban campus. They seek students who will actively engage in seminar-style classes and take advantage of NYC's cultural and intellectual resources."
    },
    "academic_criteria": {
      "gpa_expectations": "Nearly all admitted students in top 10% of class, typically 3.9-4.0 unweighted GPA",
      "test_scores": {
        "sat_range": "1490-1570 (middle 50%)",
        "sat_math": "760-800 (middle 50%)",
        "sat_ebrw": "730-770 (middle 50%)",
        "act_range": "33-35 (middle 50%)",
        "testing_requirement": "Test-flexible policy - can submit SAT, ACT, or three AP exam scores",
        "superscoring": "Yes, Columbia superscores SAT and ACT"
      },
      "course_rigor": "Most demanding curriculum available. Strong preparation in humanities, sciences, and mathematics expected for Core success.",
      "academic_interests": "Values intellectual breadth - Core requires engagement across disciplines"
    },
    "essay_requirements": {
      "personal_statement": "Common Application or Coalition Application essay (650 words)",
      "supplemental_essays": "Multiple Columbia supplements including 'Why Columbia?' and intellectual interest questions; separate essays for Columbia College vs. Engineering",
      "essay_philosophy": "Columbia wants to see genuine intellectual curiosity and specific understanding of the Core Curriculum and NYC location. Essays should demonstrate readiness for rigorous academic community and urban environment.",
      "what_makes_strong_essays": [
        "Specific knowledge of Core Curriculum and genuine enthusiasm for it",
        "Understanding of how NYC enhances education",
        "Intellectual depth and engagement with ideas",
        "Specific courses, professors, or programs at Columbia",
        "How you'll contribute to classroom discussions",
        "Balance between intellectual pursuits and community engagement",
        "Authentic voice and reflection"
      ],
      "common_essay_mistakes": [
        "Generic 'Why Columbia' without mentioning Core Curriculum",
        "Focusing only on NYC location without academic substance",
        "Not understanding what Core Curriculum actually entails",
        "Missing opportunities to show intellectual engagement",
        "Weak Columbia College vs. Engineering school differentiation",
        "Listing famous programs without personal connection"
      ]
    },
    "extracurriculars": {
      "importance": "Very high - Columbia evaluates leadership and impact",
      "depth_vs_breadth": "Depth and sustained commitment preferred over breadth",
      "leadership_expectations": "Leadership valued, including intellectual leadership and initiative",
      "impact_demonstration": "Show sustained involvement and measurable outcomes",
      "recognition_level": "Mix of highly recognized achievements and deep local impact",
      "unique_preference": "Civic engagement, urban-focused activities, intellectual pursuits, activities showing engagement with diverse communities"
    },
    "letters_of_recommendation": {
      "requirements": "Two teacher recommendations plus counselor recommendation",
      "what_reviewers_look_for": [
        "Contribution to classroom discussions (crucial for Core success)",
        "Intellectual curiosity and engagement with ideas",
        "Character and integrity",
        "Ability to work with diverse perspectives",
        "Academic excellence and potential",
        "Specific examples of impact"
      ],
      "importance": "Critical - recommendations should demonstrate readiness for discussion-based Core classes"
    },
    "demonstrated_interest": {
      "importance": "Not officially tracked, but 'Why Columbia' essay must show genuine knowledge",
      "interviews": "Alumni interviews offered when available but not required"
    },
    "evaluation_rubrics": {
      "selection_process": "Applications reviewed by multiple readers. Strong applications discussed in committee.",
      "committee_review": "Admissions committee makes decisions after holistic review and discussion",
      "decision_framework": "Evaluation based on academic achievement, fit with Core Curriculum, extracurricular impact, essays, and recommendations",
      "key_evaluation_points": [
        "Academic preparation for rigorous Core Curriculum",
        "Intellectual curiosity and engagement with big ideas",
        "Fit with Core's discussion-based learning",
        "Potential to thrive in NYC urban environment",
        "Extracurricular depth and leadership",
        "Essay quality and Columbia-specific knowledge",
        "Recommendations showing classroom engagement",
        "Contribution to diverse community"
      ]
    },
    "unique_insights": [
      "Core Curriculum is defining feature - all students read same foundational texts, engage in seminars",
      "NYC location is both campus and classroom - Columbia seeks students who will engage with city",
      "Urban campus requires students to build community intentionally - different from traditional campuses",
      "Test-flexible policy allows three AP scores instead of SAT/ACT",
      "Columbia College focuses on liberal arts, Engineering school (SEAS) on applied science",
      "Competition is intense - one of lowest acceptance rates among Ivies (~3.9%)",
      "Strong emphasis on civic engagement and public service",
      "Location near Harlem and partnership with community shapes institutional values"
    ],
    "common_pitfalls": [
      "Not understanding or mentioning Core Curriculum in application",
      "Treating NYC as a tourist attraction rather than educational resource",
      "Generic essays that could apply to any urban university",
      "Not differentiating between Columbia College and Engineering school",
      "Missing opportunities to show intellectual engagement with texts and ideas",
      "Underestimating importance of classroom discussion skills",
      "Not demonstrating community-building in urban context",
      "Weak understanding of Columbia's specific academic structure"
    ],
    "red_flags": [
      "No mention of Core Curriculum or misunderstanding what it is",
      "Lack of intellectual curiosity or engagement with ideas",
      "Generic application without Columbia-specific knowledge",
      "Recommendations that don't show classroom participation",
      "Essays focused only on location/prestige without academic substance",
      "Shallow extracurricular involvement"
    ]
  },

  "university_of_pennsylvania": {
    "university": "University of Pennsylvania",
    "ranking": 7,
    "acceptance_rate": "~5.9%",
    "admissions_office_urls": {
      "main_admissions": "https://admissions.upenn.edu/",
      "what_penn_looks_for": "https://admissions.upenn.edu/admissions-and-financial-aid/what-penn-looks-for",
      "apply": "https://admissions.upenn.edu/apply",
      "penn_blog": "https://blog.admissions.upenn.edu/",
      "schools": "https://admissions.upenn.edu/academics/schools"
    },
    "counselor_perspectives": {
      "overall_philosophy": "Penn seeks students who demonstrate passion for learning, commitment to their community, and desire to make an impact. We value the integration of knowledge across disciplines and putting theory into practice.",
      "mission_alignment": "Penn's focus on interdisciplinary learning and practical application drives admissions. The university values students who cross traditional boundaries between disciplines and connect classroom learning to real-world impact.",
      "what_they_seek": [
        "Academic excellence and intellectual curiosity",
        "Interdisciplinary interests and thinking",
        "Practical application of knowledge - 'theory and practice'",
        "Demonstrated passion and clear interests",
        "Leadership and initiative",
        "Engagement with community",
        "Students who will take advantage of Penn's resources across four undergraduate schools",
        "Pre-professional mindset combined with liberal arts foundation"
      ],
      "evaluation_philosophy": "Penn's holistic review emphasizes fit with specific undergraduate school (College, Wharton, Engineering, Nursing) while valuing interdisciplinary exploration. Demonstrated interest in Penn's unique offerings is important."
    },
    "academic_criteria": {
      "gpa_expectations": "Most admitted students in top 10% of class, typically 3.9-4.0 unweighted GPA",
      "test_scores": {
        "sat_range": "1480-1570 (middle 50%)",
        "sat_math": "750-800 (middle 50%)",
        "sat_ebrw": "730-770 (middle 50%)",
        "act_range": "33-35 (middle 50%)",
        "testing_requirement": "Test-optional for recent cycles",
        "superscoring": "Yes, Penn superscores SAT and ACT"
      },
      "course_rigor": "Most rigorous curriculum available. Expectations vary by school - Wharton and Engineering expect strong quantitative preparation.",
      "academic_interests": "Values interdisciplinary interests and ability to cross traditional academic boundaries"
    },
    "essay_requirements": {
      "personal_statement": "Common Application or Coalition Application essay (650 words)",
      "supplemental_essays": "Multiple Penn supplements including school-specific essays for each undergraduate school, 'Why Penn?' essay, and additional short answers",
      "essay_philosophy": "Penn wants to see specific knowledge of the university's offerings and genuine enthusiasm. Essays should demonstrate interdisciplinary thinking, practical application mindset, and fit with specific undergraduate school.",
      "what_makes_strong_essays": [
        "Specific Penn programs, courses, professors, or opportunities mentioned",
        "Understanding of interdisciplinary resources (dual degrees, minors, coordinated programs)",
        "Clear fit with specific undergraduate school (College, Wharton, Engineering, Nursing)",
        "How you'll connect theory to practice",
        "Genuine passion and clear academic/career interests",
        "Understanding of Penn's urban Ivy character",
        "Specific ways you'll engage with Philadelphia community",
        "Interdisciplinary interests and connections"
      ],
      "common_essay_mistakes": [
        "Generic 'Why Penn' without specific programs or resources",
        "Not differentiating between undergraduate schools",
        "Missing interdisciplinary opportunities in essays",
        "Weak Wharton essays that don't show business interest foundation",
        "Not connecting classroom learning to real-world application",
        "Ignoring Philadelphia location and community engagement",
        "Listing famous programs without personal connection"
      ]
    },
    "extracurriculars": {
      "importance": "Very high - Penn evaluates both achievement and practical application",
      "depth_vs_breadth": "Depth and sustained leadership strongly preferred",
      "leadership_expectations": "Leadership highly valued, especially showing initiative and impact",
      "impact_demonstration": "Must show tangible outcomes and sustained commitment. Penn values practical application of interests.",
      "recognition_level": "Mix of high-level recognition and deep community impact",
      "unique_preference": "Business/entrepreneurship, community engagement, interdisciplinary projects, activities showing real-world application of knowledge"
    },
    "letters_of_recommendation": {
      "requirements": "Two teacher recommendations plus counselor recommendation",
      "what_reviewers_look_for": [
        "Intellectual curiosity and classroom engagement",
        "Leadership and initiative",
        "Character and integrity",
        "Collaboration with peers",
        "Specific examples of impact and achievement",
        "Interdisciplinary thinking"
      ],
      "importance": "Very important - strong recommendations can significantly boost application"
    },
    "demonstrated_interest": {
      "importance": "Considered - Penn values genuine interest demonstrated through campus visits, essays, and engagement",
      "interviews": "Alumni interviews strongly encouraged when available, evaluative"
    },
    "evaluation_rubrics": {
      "selection_process": "Applications read by regional officers, strong applications get multiple reads and committee discussion",
      "committee_review": "Admissions committee makes final decisions after holistic review",
      "decision_framework": "Evaluation based on academic achievement, school-specific fit, interdisciplinary interests, extracurricular impact, and demonstrated interest",
      "key_evaluation_points": [
        "Academic excellence and preparation for rigorous curriculum",
        "Fit with specific undergraduate school (College/Wharton/Engineering/Nursing)",
        "Interdisciplinary interests and thinking",
        "Extracurricular depth, leadership, and impact",
        "Essay quality and Penn-specific knowledge",
        "Demonstrated interest in Penn",
        "Recommendations showing classroom excellence and character",
        "Practical application mindset"
      ]
    },
    "unique_insights": [
      "Penn is 'urban Ivy' - engaged with Philadelphia community and city resources",
      "Four undergraduate schools require different preparation: College (liberal arts), Wharton (business), Engineering, Nursing",
      "Interdisciplinary opportunities are exceptional - dual degrees, coordinated programs, minors across schools",
      "Pre-professional culture stronger than other Ivies - practical application valued",
      "Benjamin Franklin's vision of practical education still shapes institutional culture",
      "Strong entrepreneurship ecosystem and business mindset across schools",
      "Demonstrated interest matters more at Penn than some other top schools",
      "Wharton is world's top undergraduate business program - extremely competitive",
      "Penn has highest percentage of international students among Ivies"
    ],
    "common_pitfalls": [
      "Not understanding differences between Penn's four undergraduate schools",
      "Weak 'Why Penn' essays without specific knowledge",
      "Missing Penn's interdisciplinary strengths in application",
      "Not demonstrating genuine interest through essays and engagement",
      "Wharton applicants without clear business interest or foundation",
      "Ignoring Philadelphia location and community engagement opportunities",
      "Generic essays that could apply to any Ivy",
      "Not showing practical application mindset",
      "Underestimating importance of alumni interview"
    ],
    "red_flags": [
      "Lack of specific knowledge about Penn's programs and resources",
      "No clear fit with chosen undergraduate school",
      "Missing interdisciplinary interests",
      "Weak demonstrated interest",
      "Generic application without Penn-specific research",
      "Wharton applicants with no business/economics background",
      "Shallow extracurricular involvement"
    ]
  },

  "duke_university": {
    "university": "Duke University",
    "ranking": 8,
    "acceptance_rate": "~6%",
    "admissions_office_urls": {
      "main_admissions": "https://admissions.duke.edu/",
      "application": "https://admissions.duke.edu/apply",
      "duke_life": "https://admissions.duke.edu/discover/duke-life",
      "admissions_blog": "https://admissions.duke.edu/blog",
      "visit": "https://admissions.duke.edu/visit"
    },
    "counselor_perspectives": {
      "overall_philosophy": "Duke seeks students who are curious, collaborative, and committed to making a positive impact. We look for students who will engage deeply with their education, contribute to our vibrant community, and connect learning with purpose.",
      "mission_alignment": "Duke's focus on 'knowledge in service to society' drives admissions. The university values students who combine academic excellence with community engagement and demonstrate how they'll use their Duke education to make a difference.",
      "what_they_seek": [
        "Academic excellence and intellectual curiosity",
        "Connecting learning with purpose - 'knowledge in service to society'",
        "Collaborative spirit and community engagement",
        "Leadership and initiative",
        "Demonstrated impact and service",
        "Students who will engage with DukeEngage and service opportunities",
        "Balance between achievement and character",
        "Diverse perspectives and experiences"
      ],
      "evaluation_philosophy": "Duke's holistic review emphasizes both achievement and character. They seek students who show intellectual vitality, commitment to others, and desire to make positive impact."
    },
    "academic_criteria": {
      "gpa_expectations": "Most admitted students in top 10% of class, typically 3.9-4.0 unweighted GPA",
      "test_scores": {
        "sat_range": "1480-1570 (middle 50%)",
        "sat_math": "750-800 (middle 50%)",
        "sat_ebrw": "720-770 (middle 50%)",
        "act_range": "33-35 (middle 50%)",
        "testing_requirement": "Test-optional for recent cycles",
        "superscoring": "Yes, Duke superscores SAT and ACT"
      },
      "course_rigor": "Most demanding curriculum available. Duke expects strong preparation across disciplines.",
      "academic_interests": "Values interdisciplinary interests - students explore across Trinity College of Arts & Sciences and Pratt School of Engineering"
    },
    "essay_requirements": {
      "personal_statement": "Common Application essay (650 words)",
      "supplemental_essays": "Multiple Duke supplements including 'Why Duke?' and prompts about community, learning, and purpose",
      "essay_philosophy": "Duke wants to see genuine connection between your interests and Duke's mission. Essays should demonstrate understanding of 'knowledge in service to society' and how you'll contribute to collaborative community.",
      "what_makes_strong_essays": [
        "Specific Duke programs and opportunities (DukeEngage, Bass Connections, etc.)",
        "Understanding of service and impact orientation",
        "How you connect learning with purpose",
        "Genuine enthusiasm for Duke's collaborative culture",
        "Balance between achievement and character",
        "Specific examples of community engagement",
        "Understanding of Trinity vs. Pratt (Engineering)",
        "Authentic voice and reflection"
      ],
      "common_essay_mistakes": [
        "Generic 'Why Duke' without specific programs",
        "Not mentioning service or community engagement",
        "Missing Duke's 'knowledge in service to society' mission",
        "Weak differentiation between Trinity and Pratt",
        "Focusing only on basketball/campus beauty without academic substance",
        "Not demonstrating collaborative spirit",
        "Listing programs without personal connection"
      ]
    },
    "extracurriculars": {
      "importance": "Very high - Duke evaluates leadership, service, and impact",
      "depth_vs_breadth": "Depth and sustained commitment strongly preferred",
      "leadership_expectations": "Leadership highly valued, especially in service-oriented activities",
      "impact_demonstration": "Must show tangible impact on community. Service and engagement are central to Duke's mission.",
      "recognition_level": "Mix of high-level achievement and deep community service",
      "unique_preference": "Service and community engagement, collaborative projects, activities connecting learning with impact"
    },
    "letters_of_recommendation": {
      "requirements": "Two teacher recommendations plus counselor recommendation; optional additional recommendation",
      "what_reviewers_look_for": [
        "Intellectual curiosity and classroom engagement",
        "Character, integrity, and ethical commitment",
        "Collaborative spirit and relationship with peers",
        "Leadership and initiative",
        "Specific examples of impact",
        "Service orientation"
      ],
      "importance": "Very important - character and community engagement should come through in recommendations"
    },
    "demonstrated_interest": {
      "importance": "Considered - Duke values genuine interest",
      "interviews": "Alumni interviews offered when available, strongly encouraged"
    },
    "evaluation_rubrics": {
      "selection_process": "Applications read by regional admissions officers, strong applications discussed in committee",
      "committee_review": "Full committee review for competitive applicants",
      "decision_framework": "Holistic evaluation of academic achievement, character, service, leadership, and fit with Duke's mission",
      "key_evaluation_points": [
        "Academic excellence and intellectual curiosity",
        "Service and community engagement",
        "Leadership and initiative",
        "Character and collaborative spirit",
        "Connection between learning and purpose",
        "Essay quality and Duke-specific knowledge",
        "Recommendations showing character and impact",
        "Contribution to diverse community"
      ]
    },
    "unique_insights": [
      "DukeEngage provides funded summer service experiences globally - admissions looks for service-oriented students",
      "Bass Connections links faculty and students across disciplines for research on societal challenges",
      "Trinity College (Arts & Sciences) and Pratt School (Engineering) have different cultures but shared values",
      "Durham location and community engagement are important - Duke partners with local community",
      "Balance between academic excellence and strong athletics/spirit (Cameron Crazies, Duke basketball)",
      "'Knowledge in service to society' is not just motto - it shapes curriculum and student culture",
      "Robertson Scholars Program (Duke-UNC partnership) attracts top students committed to public service",
      "Gothic architecture and campus beauty mentioned by many students, but substance matters more than aesthetics in admissions"
    ],
    "common_pitfalls": [
      "Not demonstrating service orientation or community engagement",
      "Weak 'Why Duke' without mentioning service mission or specific programs",
      "Focusing on basketball/sports culture without academic substance",
      "Missing connection between learning and purpose",
      "Generic essays that could apply to any top university",
      "Not understanding Trinity vs. Pratt differences",
      "Shallow community service without genuine commitment",
      "Underestimating importance of character and collaboration"
    ],
    "red_flags": [
      "No evidence of service or community engagement",
      "Lack of specific Duke knowledge in application",
      "Generic application without connection to Duke's mission",
      "Recommendations that don't show character or collaborative spirit",
      "Essays focused only on prestige/rankings without understanding values",
      "Shallow extracurricular involvement"
    ]
  }
}
